[
  {
    "line": "Are you a magician? Because whenever I look at you, everyone else disappears."
  },
  {
    "line": "Do you have a map? I keep getting lost in your eyes."
  },
  {
    "line": "If beauty were time, you'd be eternity."
  },
  {
    "line": "Is it hot in here or is it just you?"
  },
  {
    "line": "Do you have a Band-Aid? Because I just scraped my knee falling for you."
  },
  {
    "line": "If you were a vegetable, you'd be a 'cute-cumber'."
  },
  {
    "line": "Do you have a name, or can I call you mine?"
  },
  {
    "line": "Are you a camera? Because every time I look at you, I smile."
  },
  {
    "line": "If you were a fruit, you'd be a fineapple."
  },
  {
    "line": "Are you Wi-Fi? Because I'm feeling a connection."
  },
  {
    "line": "Do you believe in love at first sight, or should I walk by again?"
  },
  {
    "line": "Are you a parking ticket? Because you've got 'fine' written all over you."
  },
  {
    "line": "If you were a cat, you'd purr-sistently steal my heart."
  },
  {
    "line": "Are you a dictionary? Because you add meaning to my life."
  },
  {
    "line": "Is your name Google? Because you have everything I've been searching for."
  },
  {
    "line": "If you were a triangle, you'd be acute one."
  },
  {
    "line": "Do you have a sunburn, or are you always this hot?"
  },
  {
    "line": "If stars would fall every time I think of you, the sky would soon be empty."
  },
  {
    "line": "Are you a pie? Because you're as sweet as 3.14."
  },
  {
    "line": "Can I follow you? Because my mom told me to follow my dreams."
  },
  {
    "line": "Are you a bank loan? Because you have my interest."
  },
  {
    "line": "If you were words on a page, you'd be fine print."
  },
  {
    "line": "Do you have an eraser? Because I can't get you out of my mind."
  },
  {
    "line": "Are you a beaver? Because dam!"
  },
  {
    "line": "If kisses were snowflakes, I'd send you a blizzard."
  },
  {
    "line": "Are you a candle? Because you light up my life."
  },
  {
    "line": "Is this the Hogwarts Express? Because it feels like you and I are headed somewhere magical."
  },
  {
    "line": "If you were a tropical fruit, you'd be a 'bae-nana'."
  },
  {
    "line": "Do you like Star Wars? Because Yoda only one for me."
  },
  {
    "line": "Are you a 90-degree angle? Because you're looking right."
  },
  {
    "line": "If you were a flower, you'd be a damndelion."
  },
  {
    "line": "Do you have a pencil? Because I want to erase your past and write our future."
  },
  {
    "line": "Are you an alien? Because you just abducted my heart."
  },
  {
    "line": "Do you play soccer? Because you're a keeper."
  },
  {
    "line": "Are you a time traveler? Because I see you in my future."
  },
  {
    "line": "Do you have a compass? Because I'd be lost without you."
  },
  {
    "line": "If you were a burger at McDonald's, you'd be the McGorgeous."
  },
  {
    "line": "Are you a blanket? Because you've got me feeling cozy."
  },
  {
    "line": "Do you have a mirror in your pocket? Because I can see myself in your pants."
  },
  {
    "line": "If you were a box of crayons, you'd be the big industrial name-brand one with a built-in sharpener."
  },
  {
    "line": "Are you a 45-degree angle? Because you're acute-y."
  },
  {
    "line": "If you were a YouTube ad, I wouldn't skip."
  },
  {
    "line": "Do you have a watch? Because it's always 'our' time."
  },
  {
    "line": "Are you a keyboard? Because you're just my type."
  },
  {
    "line": "If you were a fruit, you'd be a 'sweetheart' cherry."
  },
  {
    "line": "Do you have an umbrella? Because you make me feel under the weather."
  },
  {
    "line": "If beauty were a grain of sand, you'd be a million beaches."
  },
  {
    "line": "Are you a volcano? Because I lava you."
  },
  {
    "line": "Do you like science? Because I've got my ion you."
  },
  {
    "line": "If you were a coffee, you'd be Espresso, because you're so intense."
  },
  {
    "line": "Are you a pizza? Because I find you a-peel-ing."
  },
  {
    "line": "Do you have a license? Because you're driving me crazy."
  },
  {
    "line": "If you were a desert, you'd be my sweet oasis."
  },
  {
    "line": "Are you an elevator? Because you lift me up."
  },
  {
    "line": "Do you like gardening? Because I love you a lily more each day."
  },
  {
    "line": "If you were a gem, you'd be a diamond, because you're so precious."
  },
  {
    "line": "Are you a ghost? Because you've haunted my dreams."
  },
  {
    "line": "Do you have a Band-Aid? Because I hurt my knee when I fell for you."
  },
  {
    "line": "If you were a star, you'd be the brightest in the galaxy."
  },
  {
    "line": "Are you a cake? Because I want a piece of that."
  },
  {
    "line": "Do you have a map? I'm getting lost in your eyes."
  },
  {
    "line": "If you were a book, I'd read you over and over."
  },
  {
    "line": "Are you a light bulb? Because you brighten my day."
  },
  {
    "line": "Do you like cats? Because you're purr-fect."
  },
  {
    "line": "If you were a number, you'd be number one."
  },
  {
    "line": "Are you a thief? Because you stole my heart."
  },
  {
    "line": "Do you play the piano? Because you're striking a chord with me."
  },
  {
    "line": "If you were a color, you'd be rainbow, because you brighten my world."
  },
  {
    "line": "Are you a unicorn? Because you're my fantasy."
  },
  {
    "line": "Do you have a twin? Because you're twice as nice."
  },
  {
    "line": "If you were a planet, you'd be Earth, because you mean the world to me."
  },
  {
    "line": "Are you a library book? Because I can't stop checking you out."
  },
  {
    "line": "Do you have an extra heart? Mine was stolen by you."
  },
  {
    "line": "If you were a melody, you'd be the sweetest tune."
  },
  {
    "line": "Are you a rainbow? Because you color my world."
  },
  {
    "line": "Do you like coffee? Because you espresso-ly my type."
  },
  {
    "line": "If you were a season, you'd be spring, because you bring new life to everything."
  },
  {
    "line": "Are you a camera? Because I picture us together."
  },
  {
    "line": "Do you have a sun? Because you light up my world."
  },
  {
    "line": "If you were a bird, you'd be a lovebird."
  },
  {
    "line": "Are you a jewel? Because you're so precious."
  },
  {
    "line": "Do you play chess? Because you're my queen."
  },
  {
    "line": "If you were a song, you'd be the best track on the album."
  },
  {
    "line": "Are you a poem? Because you rhyme with my heart."
  },
  {
    "line": "Do you believe in fate? Because I think we were meant to be."
  },
  {
    "line": "If you were a fruit, you'd be a mango, because you're the sweetest."
  },
  {
    "line": "Are you a painter? Because you've painted my life with colors."
  },
  {
    "line": "Do you like stars? Because you shine brighter than any."
  },
  {
    "line": "If you were a city, you'd be Paris, the city of love."
  },
  {
    "line": "Are you a candle? Because you're so bright and warm."
  },
  {
    "line": "Do you have an extra battery? Because you light up my life."
  },
  {
    "line": "If you were a dessert, you'd be a cupcake, because you're so sweet."
  },
  {
    "line": "Are you a treasure? Because you're so valuable to me."
  },
  {
    "line": "Do you play basketball? Because you're a slam dunk in my heart."
  },
  {
    "line": "If you were a day of the week, you'd be Sunday, because you're my favorite."
  },
  {
    "line": "Are you a magician? Because every time I look at you, everyone else disappears."
  },
  {
    "line": "Do you have a twin sister? Because you're twice as nice."
  },
  {
    "line": "If you were a painting, you'd be a masterpiece."
  },
  {
    "line": "Are you a bank loan? Because you've got my interest."
  },
  {
    "line": "Do you like photography? Because I picture us together."
  },
  {
    "line": "If you were a movie, you'd be a blockbuster, because you've got my attention."
  },
  {
    "line": "Are you a jewel? Because you're a gem."
  },
  {
    "line": "Do you have a Band-Aid? Because I just scraped my knee falling for you."
  }
]